# КwЧ5Д>ЫХЧ1ЪЕt Й2>ХИЬЧЙ ФХ 1 ХБЧБХЫПЫХЪ-
# ЕЩЕtФЙХБЕ2rtЫИИ ХrЕЯЩЕ1ФУЙХДЫХЙЕ17БЕХ8ЛЛЫБЙ
# ЩДЕХМtЧД Й7ХБЕДЛ wЫД4 Ч17Д>ЫХwЧДД>ЫХДЕХ ХДЧrt
# 2ЫtХЯДЧ5 ЙЫ17ДЕХК2ЫД7О
# Й7ХtЧЯ2ЫtХrtЕЪtЧ22>ХБЕЙЕtКУХЯЧХЕw ДХrt
# Ы2Х2ЕЬДЕХЯЧЪtКЯ Й7ХЩХrЧ2ФЙ7Х Х ИrЕ1Д
# Й7ХИКПЫИЙЩКЫЙХДЫХ2ЫД7ОЫХwУЬ Д>ХtЧЯ1
# 5Д>МХКrЧБЕЩП БЕЩХ ИrЕ1Д 2>МХЛЧА1ЕЩХДЫБЕЙЕt>ЫХ
# ЯХД МХИЕwЫtЬЧЙХtЫЧ1 ЯЧ4 ХЧ1ЪЕt Й2ЕЩХО ЛtЕЩЧД
# ФХИХ4Ы17УХКИ1ЕЬД Й7ХЬ ЯД7ХrЕЙЫД4
# Ч17Д>2ХМЧБЫtЧ2ХДЕХД ХЩХЕwДЕАХ ЯХД МХЧ1ЪЕt Й2ХО
# ЛtЕЩЧД ФХД БЧБХДЫХИЩФЯЧДХИХЧ1ЪЕt Й2Е2ХИЬЧЙ ФХЕД
# ХtЫЧ1 ЯЕЩЧД>ХБЧБХЕЙwЫ17Д>ЫХЧ1ЪЕt Й2>Х Х
# ИrЕ17ЯКУЙИФХtЧЯwЫ17ДЕ


text = "удачные алгоритмы сжатия или как еще г-оворят компресси позволяют не только 8ффектвно хранить конфиденциальные данные но и напрмер значительно уменьшть размер программы которую за один прем можно загрузить в память и исполнть существует не меньше дюжины разлчных упаковщиков исполнимых файлов некоторые з них содержат реализаци алгоритмов шифрованя с целью усложнить жизнь потенцальным хакерам но ни в одной из них алгоритм шфрования никак не связан с алгоритмом сжатия он реализованы как отдельные алгоритмы и спользуются раздельно"
text1 = text.replace("8", "э")
print(text1)

# удачные алгоритмы сжатия или как еще г-оворят компресси позволяют не только эффектвно хранить конфиденциальные данные но и напрмер значительно уменьшть размер программы которую за один прем можно загрузить в память и исполнть существует не меньше дюжины разлчных упаковщиков исполнимых файлов некоторые з них содержат реализаци алгоритмов шифрованя с целью усложнить жизнь потенцальным хакерам но ни в одной из них алгоритм шфрования никак не связан с алгоритмом сжатия он реализованы как отдельные алгоритмы и спользуются раздельно