# КwЧ5Д>ЫХЧ1ЪЕt Й2>ХИЬЧЙ ФХ 1 ХБЧБХЫПЫХЪ-
# ЕЩЕtФЙХБЕ2rtЫИИ ХrЕЯЩЕ1ФУЙХДЫХЙЕ17БЕХ8ЛЛЫБЙ
# ЩДЕХМtЧД Й7ХБЕДЛ wЫД4 Ч17Д>ЫХwЧДД>ЫХДЕХ ХДЧrt
# 2ЫtХЯДЧ5 ЙЫ17ДЕХК2ЫД7О
# Й7ХtЧЯ2ЫtХrtЕЪtЧ22>ХБЕЙЕtКУХЯЧХЕw ДХrt
# Ы2Х2ЕЬДЕХЯЧЪtКЯ Й7ХЩХrЧ2ФЙ7Х Х ИrЕ1Д
# Й7ХИКПЫИЙЩКЫЙХДЫХ2ЫД7ОЫХwУЬ Д>ХtЧЯ1
# 5Д>МХКrЧБЕЩП БЕЩХ ИrЕ1Д 2>МХЛЧА1ЕЩХДЫБЕЙЕt>ЫХ
# ЯХД МХИЕwЫtЬЧЙХtЫЧ1 ЯЧ4 ХЧ1ЪЕt Й2ЕЩХО ЛtЕЩЧД
# ФХИХ4Ы17УХКИ1ЕЬД Й7ХЬ ЯД7ХrЕЙЫД4
# Ч17Д>2ХМЧБЫtЧ2ХДЕХД ХЩХЕwДЕАХ ЯХД МХЧ1ЪЕt Й2ХО
# ЛtЕЩЧД ФХД БЧБХДЫХИЩФЯЧДХИХЧ1ЪЕt Й2Е2ХИЬЧЙ ФХЕД
# ХtЫЧ1 ЯЕЩЧД>ХБЧБХЕЙwЫ17Д>ЫХЧ1ЪЕt Й2>Х Х
# ИrЕ17ЯКУЙИФХtЧЯwЫ17ДЕ


text = "КwЧ5Д>Ы Ч1ЪЕt_Й2> ИЬЧЙ_Ф _1_ БЧБ ЫПЫ Ъ-ЕЩЕtФЙ БЕ2rtЫИИ_ rЕЯЩЕ1ФУЙ ДЫ ЙЕ17БЕ 8ЛЛЫБЙЩДЕ МtЧД_Й7 БЕДЛ_wЫД4_Ч17Д>Ы wЧДД>Ы ДЕ _ ДЧrt2Ыt ЯДЧ5_ЙЫ17ДЕ К2ЫД7ОЙ7 tЧЯ2Ыt rtЕЪtЧ22> БЕЙЕtКУ ЯЧ Еw_Д rtЫ2 2ЕЬДЕ ЯЧЪtКЯ_Й7 Щ rЧ2ФЙ7 _ _ИrЕ1ДЙ7 ИКПЫИЙЩКЫЙ ДЫ 2ЫД7ОЫ wУЬ_Д> tЧЯ15Д>М КrЧБЕЩП_БЕЩ _ИrЕ1Д_2>М ЛЧА1ЕЩ ДЫБЕЙЕt>Ы Я Д_М ИЕwЫtЬЧЙ tЫЧ1_ЯЧ4_ Ч1ЪЕt_Й2ЕЩ О_ЛtЕЩЧДФ И 4Ы17У КИ1ЕЬД_Й7 Ь_ЯД7 rЕЙЫД4Ч17Д>2 МЧБЫtЧ2 ДЕ Д_ Щ ЕwДЕА _Я Д_М Ч1ЪЕt_Й2 ОЛtЕЩЧД_Ф Д_БЧБ ДЫ ИЩФЯЧД И Ч1ЪЕt_Й2Е2 ИЬЧЙ_Ф ЕД tЫЧ1_ЯЕЩЧД> БЧБ ЕЙwЫ17Д>Ы Ч1ЪЕt_Й2> _ ИrЕ17ЯКУЙИФ tЧЯwЫ17ДЕ"
text1 = text.replace("Е", "о")
print(text1)
# поменяли пробел на нижнее подчеркивание
# КwЧ5Д>ЫХЧ1ЪЕt_Й2>ХИЬЧЙ_ФХ_1_ХБЧБХЫПЫХЪ-ЕЩЕtФЙХБЕ2rtЫИИ_ХrЕЯЩЕ1ФУЙХДЫХЙЕ17БЕХ8ЛЛЫБЙЩДЕХМtЧД_Й7ХБЕДЛ_wЫД4_Ч17Д>ЫХwЧДД>ЫХДЕХ_ХДЧrt2ЫtХЯДЧ5_ЙЫ17ДЕХК2ЫД7ОЙ7ХtЧЯ2ЫtХrtЕЪtЧ22>ХБЕЙЕtКУХЯЧХЕw_ДХrtЫ2Х2ЕЬДЕХЯЧЪtКЯ_Й7ХЩХrЧ2ФЙ7Х_Х_ИrЕ1ДЙ7ХИКПЫИЙЩКЫЙХДЫХ2ЫД7ОЫХwУЬ_Д>ХtЧЯ15Д>МХКrЧБЕЩП_БЕЩХ_ИrЕ1Д_2>МХЛЧА1ЕЩХДЫБЕЙЕt>ЫХЯХД_МХИЕwЫtЬЧЙХtЫЧ1_ЯЧ4_ХЧ1ЪЕt_Й2ЕЩХО_ЛtЕЩЧДФХИХ4Ы17УХКИ1ЕЬД_Й7ХЬ_ЯД7ХrЕЙЫД4Ч17Д>2ХМЧБЫtЧ2ХДЕХД_ХЩХЕwДЕАХ_ЯХД_МХЧ1ЪЕt_Й2ХОЛtЕЩЧД_ФХД_БЧБХДЫХИЩФЯЧДХИХЧ1ЪЕt_Й2Е2ХИЬЧЙ_ФХЕДХtЫЧ1_ЯЕЩЧД>ХБЧБХЕЙwЫ17Д>ЫХЧ1ЪЕt_Й2>Х_ХИrЕ17ЯКУЙИФХtЧЯwЫ17ДЕ
# поменяли букву Х на пробел, как наиболее часто встречающуюся
# КwЧ5Д>Ы Ч1ЪЕt_Й2> ИЬЧЙ_Ф _1_ БЧБ ЫПЫ Ъ-ЕЩЕtФЙ БЕ2rtЫИИ_ rЕЯЩЕ1ФУЙ ДЫ ЙЕ17БЕ 8ЛЛЫБЙЩДЕ МtЧД_Й7 БЕДЛ_wЫД4_Ч17Д>Ы wЧДД>Ы ДЕ _ ДЧrt2Ыt ЯДЧ5_ЙЫ17ДЕ К2ЫД7ОЙ7 tЧЯ2Ыt rtЕЪtЧ22> БЕЙЕtКУ ЯЧ Еw_Д rtЫ2 2ЕЬДЕ ЯЧЪtКЯ_Й7 Щ rЧ2ФЙ7 _ _ИrЕ1ДЙ7 ИКПЫИЙЩКЫЙ ДЫ 2ЫД7ОЫ wУЬ_Д> tЧЯ15Д>М КrЧБЕЩП_БЕЩ _ИrЕ1Д_2>М ЛЧА1ЕЩ ДЫБЕЙЕt>Ы Я Д_М ИЕwЫtЬЧЙ tЫЧ1_ЯЧ4_ Ч1ЪЕt_Й2ЕЩ О_ЛtЕЩЧДФ И 4Ы17У КИ1ЕЬД_Й7 Ь_ЯД7 rЕЙЫД4Ч17Д>2 МЧБЫtЧ2 ДЕ Д_ Щ ЕwДЕА _Я Д_М Ч1ЪЕt_Й2 ОЛtЕЩЧД_Ф Д_БЧБ ДЫ ИЩФЯЧД И Ч1ЪЕt_Й2Е2 ИЬЧЙ_Ф ЕД tЫЧ1_ЯЕЩЧД> БЧБ ЕЙwЫ17Д>Ы Ч1ЪЕt_Й2> _ ИrЕ17ЯКУЙИФ tЧЯwЫ17ДЕ
# поменяли букву Е на "о"
# КwЧ5Д>Ы Ч1Ъоt_Й2> ИЬЧЙ_Ф _1_ БЧБ ЫПЫ Ъ-оЩоtФЙ Бо2rtЫИИ_ rоЯЩо1ФУЙ ДЫ Йо17Бо 8ЛЛЫБЙЩДо МtЧД_Й7 БоДЛ_wЫД4_Ч17Д>Ы wЧДД>Ы До _ ДЧrt2Ыt ЯДЧ5_ЙЫ17До К2ЫД7ОЙ7 tЧЯ2Ыt rtоЪtЧ22> БоЙоtКУ ЯЧ оw_Д rtЫ2 2оЬДо ЯЧЪtКЯ_Й7 Щ rЧ2ФЙ7 _ _Иrо1ДЙ7 ИКПЫИЙЩКЫЙ ДЫ 2ЫД7ОЫ wУЬ_Д> tЧЯ15Д>М КrЧБоЩП_БоЩ _Иrо1Д_2>М ЛЧА1оЩ ДЫБоЙоt>Ы Я Д_М ИоwЫtЬЧЙ tЫЧ1_ЯЧ4_ Ч1Ъоt_Й2оЩ О_ЛtоЩЧДФ И 4Ы17У КИ1оЬД_Й7 Ь_ЯД7 rоЙЫД4Ч17Д>2 МЧБЫtЧ2 До Д_ Щ оwДоА _Я Д_М Ч1Ъоt_Й2 ОЛtоЩЧД_Ф Д_БЧБ ДЫ ИЩФЯЧД И Ч1Ъоt_Й2о2 ИЬЧЙ_Ф оД tЫЧ1_ЯоЩЧД> БЧБ оЙwЫ17Д>Ы Ч1Ъоt_Й2> _ Иrо17ЯКУЙИФ tЧЯwЫ17До
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
#  
# 
#
#