from task1 import readFile, savefile

def elementCount(text: str):
    '''Getting sorted number of elements in text'''
    
    result={}
    for i in text:
        if i in result.keys():
            continue
        sum = 0
        for j in text:
            if (i == j):
                sum += 1
        result[i] = sum
    result = sorted(result.items(), key=lambda item: -item[1])
    result = {k: v for k, v in result}
    print(result)


# result = {'Х': 82, 'Ь': 66, 'Б': 56, 'Ч': 45, 't': 40, '1': 40, 'А': 31, 'Ы': 31, ' ': 27, '<': 19, 'Д': 17, 'Ъ': 15, 'Щ': 15, 'Я': 14, 'Ф': 12, '>': 12, 'И': 12, '5': 11, 'Е': 10, '2': 10, 'r': 10, '7': 9, 'Л': 9, 'К': 9, 'О': 8, 'М': 7, 'Й': 6, 'Ш': 5, '8': 2, '4': 2, '-': 1, 'У': 1}
if __name__ == '__main__':
    text = readFile('task2_encryption')
    elementCount(text)

    text = text.replace(' ', 'Z')
    text = text.replace('Х', ' ')
    #Итог - tАЪЧ АЫ151Ъ1 ЯZЧ<tЫФБ7 1ЪЕЬZЧБ< ЩZЧЯБЬЕZ1ЛЧ5tАЩЬЕЬ ЯZtЬ2Z1ЙЬД1ЫЧФ r1ЫЫ>М БЬ ЬЩ1ИtБАФ 5БЬ 1ЪЕЬZЧБ< АИ1БЧФ Ыt <ЬИtБ 8ЛЛtЩБЧДЫЬ Z12ЬБ1Б7 Ы1 ОЧЛZЬБtЩАБ1М МЬZЬОЧМ ЩZЧЯБЬ1ЪЕЬZЧБ<ЬД АИ1Б7 ОЧЛZЬБtЩАБ ДtА7<1 БФИtЪЬ ЯЬ БЬШ ЯZЬАБЬШ ЯZЧ5ЧЫt 5БЬ ЩZЧЯ-БЬЕZ1ЛЧ5tАЩ1Ф АЧАБt<1 rЬЪИЫ1 ЪУ2><Ч rЬАБКЯЫ><Ч АЯЬАЬ21<Ч ЧЙ21ДЪФБ7 ОЧЛZЬБtЩАБ ЬБ Ь5tДЧrЫ>М ДЫКБZtЫЫЧМ Й1ДЧАЧ<ЬАБtШ 1 ЯЬБЬ<К tЕЬ 8ЫБZЬЯЧФ 2КrtБ ДtА7<1 Д>АЬЩЬШ Ч КИ БЬ5ЫЬ Ы1<ЫЬЕЬ Д>Оt 5t< К ЬБЩZ>БЬЕЬ БtЩАБ1 ЯZtrАБ1ДЧБ7 Аt2t 1ЪЕЬZЧБ< АИ1БЧФ ЩЬБЬZ>Ш 2> МЬZЬОЬ АИЧ<1Ъ Й1ОК<ЪtЫЫ>t r1ЫЫ>t rЬДЬЪ7ЫЬ БФИtЪЬ Дtr7 r1Иt ЧЫБКЧБЧДЫЬ ЯЬЫФБЫЬ 5БЬ АИ1БЧt ДАt4tЪЬ 21ЙЧZКtБАФ Ы1 ЧЙ2>БЬ5ЫЬАБЧ ЧЫЛЬZ<14ЧЧ Д БtЩАБt ОЧЛ
    # союз 5БЬ встречается 3 раза, предположим это ЧТО
    text = text.replace('Ь', 'о')
    text = text.replace('Б', 'т')
    text = text.replace('5', 'ч')
    #Итог - tАЪЧ АЫ1ч1Ъ1 ЯZЧ<tЫФт7 1ЪЕоZЧт< ЩZЧЯтоЕZ1ЛЧчtАЩоЕо ЯZtо2Z1ЙоД1ЫЧФ r1ЫЫ>М то оЩ1ИtтАФ что 1ЪЕоZЧт< АИ1тЧФ Ыt <оИtт 8ЛЛtЩтЧДЫо Z12от1т7 Ы1 ОЧЛZотtЩАт1М МоZоОЧМ ЩZЧЯто1ЪЕоZЧт<оД АИ1т7 ОЧЛZотtЩАт ДtА7<1 тФИtЪо Яо тоШ ЯZоАтоШ ЯZЧчЧЫt что ЩZЧЯ-тоЕZ1ЛЧчtАЩ1Ф АЧАтt<1 rоЪИЫ1 ЪУ2><Ч rоАтКЯЫ><Ч АЯоАо21<Ч ЧЙ21ДЪФт7 ОЧЛZотtЩАт от очtДЧrЫ>М ДЫКтZtЫЫЧМ Й1ДЧАЧ<оАтtШ 1 Яото<К tЕо 8ЫтZоЯЧФ 2Кrtт ДtА7<1 Д>АоЩоШ Ч КИ точЫо Ы1<ЫоЕо Д>Оt чt< К отЩZ>тоЕо тtЩАт1 ЯZtrАт1ДЧт7 Аt2t 1ЪЕоZЧт< АИ1тЧФ ЩотоZ>Ш 2> МоZоОо АИЧ<1Ъ Й1ОК<ЪtЫЫ>t r1ЫЫ>t rоДоЪ7Ыо тФИtЪо Дtr7 r1Иt ЧЫтКЧтЧДЫо ЯоЫФтЫо что АИ1тЧt ДАt4tЪо 21ЙЧZКtтАФ Ы1 ЧЙ2>точЫоАтЧ ЧЫЛоZ<14ЧЧ Д тtЩАтt ОЧЛ
    # 'от очtДЧrЫ>М' - 'от очевидн>М' 
    text = text.replace('Д', 'в')
    text = text.replace('t', 'е')
    text = text.replace('Ч', 'и')
    text = text.replace('r', 'д')
    text = text.replace('Ы', 'н')
    #Итог - еАЪи Ан1ч1Ъ1 ЯZи<енФт7 1ЪЕоZит< ЩZиЯтоЕZ1ЛичеАЩоЕо ЯZео2Z1Йов1ниФ д1нн>М то оЩ1ИетАФ что 1ЪЕоZит< АИ1тиФ не <оИет 8ЛЛеЩтивно Z12от1т7 н1 ОиЛZотеЩАт1М МоZоОиМ ЩZиЯто1ЪЕоZит<ов АИ1т7 ОиЛZотеЩАт веА7<1 тФИеЪо Яо тоШ ЯZоАтоШ ЯZичине что ЩZиЯ-тоЕZ1ЛичеАЩ1Ф АиАте<1 доЪИн1 ЪУ2><и доАтКЯн><и АЯоАо21<и иЙ21вЪФт7 ОиЛZотеЩАт от очевидн>М внКтZенниМ Й1виАи<оАтеШ 1 Яото<К еЕо 8нтZоЯиФ 2Кдет веА7<1 в>АоЩоШ и КИ точно н1<ноЕо в>Ое че< К отЩZ>тоЕо теЩАт1 ЯZедАт1вит7 Ае2е 1ЪЕоZит< АИ1тиФ ЩотоZ>Ш 2> МоZоОо АИи<1Ъ Й1ОК<Ъенн>е д1нн>е довоЪ7но тФИеЪо вед7 д1Ие интКитивно ЯонФтно что АИ1тие вАе4еЪо 21ЙиZКетАФ н1 иЙ2>точноАти инЛоZ<14ии в теЩАте ОиЛ
    # 'еАЪи' - 'если'; 'довоЪ7но' - 'довольно'; 'д1Ие' - 'даже'; 'ЯZичине' - 'причине'
    text = text.replace('А', 'с')
    text = text.replace('Ъ', 'л')
    text = text.replace('7', 'ь')
    text = text.replace('1', 'а')
    text = text.replace('И', 'ж')
    text = text.replace('Я', 'п')
    text = text.replace('Z', 'р')
    # Итог - если сначала при<енФть алЕорит< ЩриптоЕраЛичесЩоЕо прео2раЙованиФ данн>М то оЩажетсФ что алЕорит< сжатиФ не <ожет 8ЛЛеЩтивно ра2отать на ОиЛротеЩстаМ МороОиМ ЩриптоалЕорит<ов сжать ОиЛротеЩст весь<а тФжело по тоШ простоШ причине что Щрип-тоЕраЛичесЩаФ систе<а должна лУ2><и достКпн><и спосо2а<и иЙ2авлФть ОиЛротеЩст от очевидн>М внКтренниМ Йависи<остеШ а пото<К еЕо 8нтропиФ 2Кдет весь<а в>соЩоШ и Кж точно на<ноЕо в>Ое че< К отЩр>тоЕо теЩста представить се2е алЕорит< сжатиФ Щотор>Ш 2> МороОо сжи<ал ЙаОК<ленн>е данн>е довольно тФжело ведь даже интКитивно понФтно что сжатие все4ело 2аЙирКетсФ на иЙ2>точности инЛор<а4ии в теЩсте ОиЛ
    # осталось немного:
    text = text.replace('Щ', 'к')
    text = text.replace('Л', 'ф')
    text = text.replace('<', 'м')
    text = text.replace('4', 'ц')
    text = text.replace('Ф', 'я')
    text = text.replace('К', 'у')
    text = text.replace('Е', 'г')
    text = text.replace('2', 'б')
    text = text.replace('Й', 'з')
    text = text.replace('8', 'э')
    text = text.replace('М', 'х')
    text = text.replace('>', 'ы')
    text = text.replace('О', 'ш')
    text = text.replace('Ш', 'й')
    text = text.replace('У', 'ю')

    savefile(text, 'task2_decryption')
    print(text)


